<h1>
   <font color = "grey">Fundamentos da linguagem Python</font>
</h1>

# MÓDULO 1

## 1.1. Operadores matemáticos

In [1]:
# adição 

5 + 7

12

In [2]:
# subtração 

21 - 9

12

In [3]:
# multiplicação 

3 * 9

27

In [4]:
# divisão

59 / 3

19.666666666666668

### 1.1.1. Operação com variáveis

In [5]:
a = 39

In [6]:
b = a + 1

In [7]:
b

40

In [8]:
b * 2

80

**Aquecimento operadores matemáticos**

In [9]:
# compras 


arroz = 10
leite = 11.50
carne = 30.80
sabonete = 9.56
alvejante = 19.58

In [10]:
resultado = arroz + leite + carne + sabonete + alvejante

In [11]:
resultado

81.44

In [12]:
print('O valor total das compras é: R$', resultado)

O valor total das compras é: R$ 81.44

In [13]:
# potenciação 

2 ** 2

4

In [14]:
# módulo ou resto da divisão 

10 % 7

3

## 1.2. Operadores relacionais

In [15]:
# igualdade

700 == 90

False

In [16]:
100 == 100

True

In [17]:
80.0 == 80

True

In [18]:
# desigualdade 

3 != 7

True

In [19]:
3 != 3

False

In [20]:
# maior que 

500 > 90

True

In [21]:
90 > 500

False

In [22]:
# menor que 

500 < 90

False

In [23]:
90 < 500

True

In [24]:
# maior ou igual 

8 >= 8

True

In [25]:
5 >= 10

False

## 1.3. Operadores lógicos

**and** = e

**or** = ou 

**not** = não

**and** = se todas as alternativas forem verdadeiras

**or** = se pelo menos uma das alternativas forem verdadeiras

**not** = se for verdadeira será falso

**1.Para estudar em uma universidade, o aluno deve:**


Ter passado no vestibular

e

Estar com toda documentação necessária

e 

Estar matriculado

In [26]:
50 > 40 and 50 > 49

True

**2. Para obter flexibilidade no período de provas, o aluno deve:**

Ser militar e estar de serviço

ou 

Estar de licença maternidade

ou 

Estar de atestado médico

In [27]:
80 > 3 or 15 > 20

True

## 1.4. Laços de repetiçoes for

In [28]:
for i in range (0, 20, 3):
    print(i)

0
3
6
9
12
15
18

Essa função cria um loop de um range(sequencia numerica) 

for é função (i) é a variável in conecta ao range ( inicio da sequncia, fim da sequencia, intervalos)

In [29]:
lista = [3, 8, 44, 100]

In [30]:
for x in lista:
    print(x)

3
8
44
100

In [31]:
lista2 = [3, 8, 44, 100]

In [32]:
for i in lista2:
    
    if i % 2 == 0:
     print(i)

8
44
100

In [33]:
lista3 = [ [1,2,3], [2,3,5], [7,8,5,4,3,2] ]

In [34]:
for ii in lista3:
    print(ii)

[1, 2, 3]
[2, 3, 5]
[7, 8, 5, 4, 3, 2]

In [35]:
di = {'d1': 10,'d2': 20,'d3': 30,'d4': 40,'d5': 50, };

d2 = {'d2': 10,'d2': 20,'d2': 30,'d2': 40,'d2': 50};

In [36]:
di

{'d1': 10, 'd2': 20, 'd3': 30, 'd4': 40, 'd5': 50}

In [37]:
for i in di:
    print(i)

d1
d2
d3
d4
d5

In [38]:
di.items()

dict_items([('d1', 10), ('d2', 20), ('d3', 30), ('d4', 40), ('d5', 50)])

In [39]:
for c, v, in di.items():
    print( c, v)

d1 10
d2 20
d3 30
d4 40
d5 50

## 1.5. Laços de repetiçoes whille(enquanto)

In [40]:
k = 8

while k <= 10:
    print(k)
    
    k += 1

8
9
10

**pass, break e continue**

In [41]:
for letra in 'programador':
    if letra == 'a':
        pass
    print(letra)

p
r
o
g
r
a
m
a
d
o
r

In [42]:
for letra in 'programador':
    if letra == 'a':
        continue
    print(letra)

p
r
o
g
r
m
d
o
r

In [43]:
for letra in 'programador':
    if letra == 'a':
        break
    print(letra)

p
r
o
g
r

## 1.6. Funções

In [44]:
 def print_text():
    print('Aqui é um texto qaulquer')

In [45]:
print_text()

Aqui é um texto qaulquer

In [46]:
def print_isto(x):
    print(x)

In [47]:
print_isto(7958)

7958

In [48]:
def potencia(x):
    p = x ** 2
    return p

In [49]:
potencia(4)

16

In [50]:
def sub(x):
    r = x + 4
    return r

In [51]:
sub (1000)

1004

In [52]:
def potencia_n(x, n = 2 ):
    p = x ** n
    return p

In [53]:
potencia_n(5)

25

In [54]:
potencia_n(5, 3)

125

# MÓDULO 2

### IMPORTS

In [55]:
import pandas as pd
import numpy as np

## 2.1. Dataframes

In [56]:
series = pd.Series([7, 4, 2, np.nan, 6, 9 ])

In [57]:
series

0    7.0
1    4.0
2    2.0
3    NaN
4    6.0
5    9.0
dtype: float64

In [58]:
type(series)

pandas.core.series.Series

In [59]:
datas = pd.date_range('20220101', periods = 6 )

In [60]:
datas

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06'],
              dtype='datetime64[ns]', freq='D')

In [61]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [62]:
df = pd.DataFrame(np.random.randn(6,4), index= datas, columns = list('ABCD'))

In [63]:
df

                   A         B         C         D
2022-01-01  0.464518  1.548093  1.568508 -0.383810
2022-01-02  1.781279  0.449141 -0.242726  0.724674
2022-01-03 -1.199956 -0.641651 -0.781283  0.235360
2022-01-04  0.505532 -2.439244  1.385963 -0.897305
2022-01-05 -0.742145 -0.479046  0.188150 -0.083268
2022-01-06 -1.453562  0.622041  0.006414  1.700925

In [64]:
df2 = pd.DataFrame({'A': 7,
                    'B': pd.Timestamp('20220101'),
                    'C': pd.Series(1, index=list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'), 
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'})

In [65]:
df2

   A          B    C  D      E       F
0  7 2022-01-01  1.0  3   test  Python
1  7 2022-01-01  1.0  3  train  Python
2  7 2022-01-01  1.0  3   test  Python
3  7 2022-01-01  1.0  3  train  Python

In [66]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 2.2. Merge

In [67]:
# Cadastro da loja a
cadastro_a = {'Id': ['AA2930','BB4563','CC2139','DE2521','GT3462','HH1158'],
            'Nome':  ['Victor', 'Amanda', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
            'Idade': [20,35,40,54,30,27],
            'CEP': ['00092-029','11111-111','22222-888','00000-999','88888-111','77777-666']
           }

cadastro_a = pd.DataFrame(cadastro_a, columns = ['Id','Nome','Idade','CEP'])
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [68]:
# Cadastro da loja b
cadastro_b = {'Id': ['CC9999','EF4488','DD9999','GT3462','HH1158'],
            'Nome':  ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
            'Idade': [19,30,22,30,27],
            'CEP': ['00092-029','11111-111','11111-888','88888-111','77777-666']
           }
 
cadastro_b = pd.DataFrame(cadastro_b, columns = ['Id','Nome','Idade','CEP'])
cadastro_b

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00092-029
1  EF4488  Patricia     30  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

In [69]:
# Registro de compras de todas unidades
compras = {'Id': ['AA2930','EF4488','CC2139','EF4488','CC9999','AA2930','HH1158','HH1158'],
            'Data':  ['2019-01-01','2019-01-30','2019-01-30','2019-02-01','2019-02-20','2019-03-15','2019-04-01','2019-04-10'],
            'Valor': [200,100,40,150,300,25,50,500]
           }
 
compras = pd.DataFrame(compras, columns = ['Id','Data','Valor'])

compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

* Merge **inner join** junta a interceção entre as tabelas

In [70]:
pd.merge(cadastro_a, cadastro_b[['Id', 'Idade', 'CEP']], on= ['Id'], how='inner', suffixes= ('_A', '_B'))

       Id     Nome  Idade_A      CEP_A  Idade_B      CEP_B
0  GT3462  Ricardo       30  88888-111       30  88888-111
1  HH1158    Maria       27  77777-666       27  77777-666

* Merge **full join** junta a todas as informações das tabelas

In [71]:
lojas = pd.concat([cadastro_a, cadastro_b], ignore_index= True)

In [72]:
clientes_unicos = lojas.drop_duplicates(subset=['Id'])

In [73]:
clientes_unicos

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  BB4563    Amanda     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666
6  CC9999    Marcos     19  00092-029
7  EF4488  Patricia     30  11111-111
8  DD9999    Ericka     22  11111-888

* Merge **left join** junta informações do lado esquerdo da tabela

In [74]:
esquerda = pd.merge(cadastro_a, compras, how='left', on=['Id'])

In [75]:
compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [76]:
cadastro_a

       Id     Nome  Idade        CEP
0  AA2930   Victor     20  00092-029
1  BB4563   Amanda     35  11111-111
2  CC2139    Bruna     40  22222-888
3  DE2521   Carlos     54  00000-999
4  GT3462  Ricardo     30  88888-111
5  HH1158    Maria     27  77777-666

In [77]:
esquerda

       Id     Nome  Idade        CEP        Data  Valor
0  AA2930   Victor     20  00092-029  2019-01-01  200.0
1  AA2930   Victor     20  00092-029  2019-03-15   25.0
2  BB4563   Amanda     35  11111-111         NaN    NaN
3  CC2139    Bruna     40  22222-888  2019-01-30   40.0
4  DE2521   Carlos     54  00000-999         NaN    NaN
5  GT3462  Ricardo     30  88888-111         NaN    NaN
6  HH1158    Maria     27  77777-666  2019-04-01   50.0
7  HH1158    Maria     27  77777-666  2019-04-10  500.0

In [78]:
esquerda.groupby(['Id', 'Nome'])['Valor'].sum()

Id      Nome
AA2930  Victor     225.0
BB4563  Amanda       0.0
CC2139  Bruna       40.0
DE2521  Carlos       0.0
GT3462  Ricardo      0.0
HH1158  Maria      550.0
Name: Valor, dtype: float64

## 2.3. Groupby

In [79]:
dfg = pd.DataFrame({'A': ['verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso', 'verdadeiro', 'falso'],
                    
                    'B': ['um', 'um', 'dois', 'tres', 'dois', ' dois', 'um ', 'tres'],
                    
                    'C': np.random.randn(8),
                    
                    'D': np.random.randn(8)})

In [80]:
dfg

            A      B         C         D
0  verdadeiro     um  0.115123 -0.853005
1       falso     um -0.439573  0.664527
2  verdadeiro   dois  0.489212  0.411203
3       falso   tres  1.880224 -0.690515
4  verdadeiro   dois -0.615325  0.591808
5       falso   dois -0.324936  2.434682
6  verdadeiro    um   0.129989 -0.019274
7       falso   tres  0.942944  0.685802

#### Soma dos valores das colunas baseada na coluna A

In [81]:
dfg.groupby(['A']).sum()

                   C         D
A
falso       2.058659  3.094496
verdadeiro  0.118998  0.130733

#### Média dos valores das colunas baseada na coluna A

In [82]:
dfg.groupby(['A']).mean()

                   C         D
A
falso       0.514665  0.773624
verdadeiro  0.029750  0.032683

#### Soma dos valores das colunas baseada na coluna B

In [83]:
dfg.groupby(['B']).sum()

              C         D
B
 dois -0.324936  2.434682
dois  -0.126114  1.003012
tres   2.823168 -0.004713
um    -0.324450 -0.188479
um     0.129989 -0.019274

#### Média dos valores das colunas baseada na coluna B

In [84]:
dfg.groupby(['B']).mean()

              C         D
B
 dois -0.324936  2.434682
dois  -0.063057  0.501506
tres   1.411584 -0.002356
um    -0.162225 -0.094239
um     0.129989 -0.019274

#### Soma dos valores das colunas baseada nas colunas A e B

In [85]:
dfg.groupby(['A','B']).sum()

                         C         D
A          B
falso       dois -0.324936  2.434682
           tres   2.823168 -0.004713
           um    -0.439573  0.664527
verdadeiro dois  -0.126114  1.003012
           um     0.115123 -0.853005
           um     0.129989 -0.019274

## 2.4. Indexação

Todo índice em pyhon inicia em 0.

Sempre que quisermos selecionar algum objeto em uma lista, devemos considerar esse requisito.

In [86]:
lista = [ 32, 96, 11, 27]

In [87]:
lista[0]

32

Sempre que quisermos selecionar os números de trás pra frente, basta adicionar o sinal de subtração e ordenar a casa

In [88]:
lista [-1]

27

### Indexação múltlipla

In [89]:
arrays = [[1, 2, 5, 4], ['red', 'blue', 'green', 'blue']]

In [90]:
pd.MultiIndex.from_arrays(arrays, names=('number', 'color'))

MultiIndex([(1,   'red'),
            (2,  'blue'),
            (5, 'green'),
            (4,  'blue')],
           names=['number', 'color'])

In [91]:
numbers = [0, 1, 2]
colors = ['green', 'purple']

**MultiIndex com produto cartesiano**

In [92]:
pd.MultiIndex.from_product([numbers, colors], names = ['number', 'color'])

MultiIndex([(0,  'green'),
            (0, 'purple'),
            (1,  'green'),
            (1, 'purple'),
            (2,  'green'),
            (2, 'purple')],
           names=['number', 'color'])

## 2.5. Reshping dados

In [93]:
datas = pd.date_range('20220101', periods= 6 )

df = pd.DataFrame(np.random.randn(6, 4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [94]:
df

               var_A     var_B     var_C     var_D
2022-01-01  1.108364  0.933793  0.178068 -0.127550
2022-01-02  1.225588  0.226341  0.530342  2.017342
2022-01-03 -0.466156 -0.052488 -1.888489 -0.775619
2022-01-04  0.835388  1.183071 -0.806877 -0.276428
2022-01-05 -1.296992 -0.975793 -0.183804 -1.259496
2022-01-06 -0.068037  1.113119  0.284113 -0.369372

In [95]:
dft = df.T

In [96]:
dft

       2022-01-01  2022-01-02  2022-01-03  2022-01-04  2022-01-05  2022-01-06
var_A    1.108364    1.225588   -0.466156    0.835388   -1.296992   -0.068037
var_B    0.933793    0.226341   -0.052488    1.183071   -0.975793    1.113119
var_C    0.178068    0.530342   -1.888489   -0.806877   -0.183804    0.284113
var_D   -0.127550    2.017342   -0.775619   -0.276428   -1.259496   -0.369372

In [97]:
df.shape

(6, 4)

### 2.5.1. Função pivot

In [98]:
data = pd.date_range('20220101', periods= 12 )

pessoa = ['George', 'Victor', 'Lucas']

In [99]:
data

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12'],
              dtype='datetime64[ns]', freq='D')

In [100]:
nome = []

gasto = []

for i in range(12):
    nome.append(np.random.choice(pessoa))
    gasto.append(np.round(np.random.randn()*100,2 ))
    
    nome

In [101]:
df = pd.DataFrame({'Data': data, 'Nome': nome, 'Gasto': gasto})

In [102]:
df

         Data    Nome   Gasto
0  2022-01-01  Victor  -44.06
1  2022-01-02  Victor  -74.18
2  2022-01-03   Lucas  -50.25
3  2022-01-04   Lucas  -62.83
4  2022-01-05  George   68.45
5  2022-01-06   Lucas   80.92
6  2022-01-07  Victor -125.06
7  2022-01-08   Lucas  102.35
8  2022-01-09   Lucas  -48.57
9  2022-01-10   Lucas   -2.14
10 2022-01-11  Victor   45.00
11 2022-01-12   Lucas    4.29

In [103]:
pd.pivot(df, index= 'Data', columns= 'Nome', values= 'Gasto')

Nome        George   Lucas  Victor
Data
2022-01-01     NaN     NaN  -44.06
2022-01-02     NaN     NaN  -74.18
2022-01-03     NaN  -50.25     NaN
2022-01-04     NaN  -62.83     NaN
2022-01-05   68.45     NaN     NaN
2022-01-06     NaN   80.92     NaN
2022-01-07     NaN     NaN -125.06
2022-01-08     NaN  102.35     NaN
2022-01-09     NaN  -48.57     NaN
2022-01-10     NaN   -2.14     NaN
2022-01-11     NaN     NaN   45.00
2022-01-12     NaN    4.29     NaN

### 2.5.2. Função pivot table

In [104]:
carros = [7, 4, 3, 2, 8]

data = pd.date_range('20220101','20220101', periods= 5 )

vendedor = ['George', 'Vagner', 'Pedro', 'Vagner', 'George']

In [105]:
df = pd.DataFrame({'Vendas': carros, 'Data': data, 'Vendedor': vendedor})

In [106]:
df

   Vendas       Data Vendedor
0       7 2022-01-01   George
1       4 2022-01-01   Vagner
2       3 2022-01-01    Pedro
3       2 2022-01-01   Vagner
4       8 2022-01-01   George

A função **pivot table** não entrega valores de index duplicados

In [107]:
pd.pivot_table(df, index= 'Data', columns= 'Vendedor', values= 'Vendas', aggfunc='sum')

Vendedor    George  Pedro  Vagner
Data
2022-01-01      15      3       6

### 2.5.3. Stack e unstack de dados

coleta de dados da internet

In [108]:
df = pd.read_csv('https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv')

In [109]:
df.head(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0

In [110]:
df.shape

(458, 9)

In [111]:
#Essa função empilha os dados em uma coluna

empilhamento = df.stack()

In [112]:
empilhamento.head(20)

0  Name         Avery Bradley
   Team        Boston Celtics
   Number                 0.0
   Position                PG
   Age                   25.0
   Height                 6-2
   Weight               180.0
   College              Texas
   Salary           7730337.0
1  Name           Jae Crowder
   Team        Boston Celtics
   Number                99.0
   Position                SF
   Age                   25.0
   Height                 6-6
   Weight               235.0
   College          Marquette
   Salary           6796117.0
2  Name          John Holland
   Team        Boston Celtics
dtype: object

In [113]:
# Essa função reverte o processo de empilhamento

empilhamento.unstack()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

### 2.5.4. Função melt

In [114]:
df = pd.DataFrame({ 'A': {0: 'a', 1: 'b', 2: 'c'},
                    'B': {0: 1, 1: 3, 2: 5,},
                    'C': {0: 2, 1: 4, 2: 6}})

In [115]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [116]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [117]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [118]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'], var_name='nome da var', value_name='valor da var')

   A nome da var  valor da var
0  a           B             1
1  b           B             3
2  c           B             5
3  a           C             2
4  b           C             4
5  c           C             6

In [119]:
data = {
    'Localização' : ['cidadeA', 'cidadeB'], 
    'Temperatura' : ['prevista', 'atual'],
    'Set-2021':     [30, 32],
    'Out-2021':     [45, 43],
    'Nov-2021':     [24, 22]
}

print(data)

{'Localização': ['cidadeA', 'cidadeB'], 'Temperatura': ['prevista', 'atual'], 'Set-2021': [30, 32], 'Out-2021': [45, 43], 'Nov-2021': [24, 22]}

In [120]:
df = pd.DataFrame(data, columns = ['Localização', 'Temperatura', 'Set-2021', 'Out-2021', 'Nov-2021'])
df

  Localização Temperatura  Set-2021  Out-2021  Nov-2021
0     cidadeA    prevista        30        45        24
1     cidadeB       atual        32        43        22

In [121]:
df2 = pd.melt(df, id_vars=['Localização', 'Temperatura'], var_name='Data', value_name='Valor')

df2

  Localização Temperatura      Data  Valor
0     cidadeA    prevista  Set-2021     30
1     cidadeB       atual  Set-2021     32
2     cidadeA    prevista  Out-2021     45
3     cidadeB       atual  Out-2021     43
4     cidadeA    prevista  Nov-2021     24
5     cidadeB       atual  Nov-2021     22

## 2.6. Seleção de linhas e colunas

In [122]:
datas = pd.date_range('20210101', periods = 600)

df = pd.DataFrame(np.random.rand(600, 5), index = datas, columns = list('ABCDE'))

In [123]:
df.head(4)

                   A         B         C         D         E
2021-01-01  0.402597  0.826211  0.444253  0.329025  0.960315
2021-01-02  0.195215  0.230581  0.093626  0.763088  0.789160
2021-01-03  0.828667  0.866978  0.659408  0.118299  0.874435
2021-01-04  0.837308  0.665054  0.744328  0.540468  0.657550

In [124]:
df['D'].tail(5)

2022-08-19    0.288441
2022-08-20    0.059265
2022-08-21    0.876388
2022-08-22    0.607972
2022-08-23    0.650374
Freq: D, Name: D, dtype: float64

In [125]:
df[1 : 5]

                   A         B         C         D         E
2021-01-02  0.195215  0.230581  0.093626  0.763088  0.789160
2021-01-03  0.828667  0.866978  0.659408  0.118299  0.874435
2021-01-04  0.837308  0.665054  0.744328  0.540468  0.657550
2021-01-05  0.372198  0.687217  0.044099  0.259574  0.072387

In [126]:
df.loc[:, ['B', 'C', 'D']]

                   B         C         D
2021-01-01  0.826211  0.444253  0.329025
2021-01-02  0.230581  0.093626  0.763088
2021-01-03  0.866978  0.659408  0.118299
2021-01-04  0.665054  0.744328  0.540468
2021-01-05  0.687217  0.044099  0.259574
...              ...       ...       ...
2022-08-19  0.457193  0.431630  0.288441
2022-08-20  0.098357  0.629108  0.059265
2022-08-21  0.598208  0.650608  0.876388
2022-08-22  0.357694  0.979289  0.607972
2022-08-23  0.754326  0.863149  0.650374

[600 rows x 3 columns]

**Filtragem do intervalo entre as datas especificadas e das colunas A e C**

In [127]:
df.loc['20220101' : '20220323', ['A', 'C']].head(5)

                   A         C
2022-01-01  0.435582  0.895076
2022-01-02  0.341976  0.575061
2022-01-03  0.460423  0.240820
2022-01-04  0.225618  0.938291
2022-01-05  0.342768  0.472574

**Filtragem de todas as colunas da linha 1**

In [128]:
df.iloc[1]

A    0.195215
B    0.230581
C    0.093626
D    0.763088
E    0.789160
Name: 2021-01-02 00:00:00, dtype: float64

**Filtragem de um intervalo específico entre linhas e colunas (1º intervalo linhas, 2º colunas)**

In [129]:
df.iloc[1:4, 1: 6]

                   B         C         D         E
2021-01-02  0.230581  0.093626  0.763088  0.789160
2021-01-03  0.866978  0.659408  0.118299  0.874435
2021-01-04  0.665054  0.744328  0.540468  0.657550

**Filtragem de linhas e colunas escolhidas**

In [130]:
df.iloc[[7, 4, 8], [0, 3]]

                   A         D
2021-01-08  0.548726  0.689335
2021-01-05  0.372198  0.259574
2021-01-09  0.150814  0.804990

**Filtros booleanos**

In [131]:
df[df.A>0]

                   A         B         C         D         E
2021-01-01  0.402597  0.826211  0.444253  0.329025  0.960315
2021-01-02  0.195215  0.230581  0.093626  0.763088  0.789160
2021-01-03  0.828667  0.866978  0.659408  0.118299  0.874435
2021-01-04  0.837308  0.665054  0.744328  0.540468  0.657550
2021-01-05  0.372198  0.687217  0.044099  0.259574  0.072387
...              ...       ...       ...       ...       ...
2022-08-19  0.188307  0.457193  0.431630  0.288441  0.829495
2022-08-20  0.879451  0.098357  0.629108  0.059265  0.775356
2022-08-21  0.384942  0.598208  0.650608  0.876388  0.110685
2022-08-22  0.771109  0.357694  0.979289  0.607972  0.324029
2022-08-23  0.521814  0.754326  0.863149  0.650374  0.899580

[600 rows x 5 columns]

In [132]:
df[df > 0]

                   A         B         C         D         E
2021-01-01  0.402597  0.826211  0.444253  0.329025  0.960315
2021-01-02  0.195215  0.230581  0.093626  0.763088  0.789160
2021-01-03  0.828667  0.866978  0.659408  0.118299  0.874435
2021-01-04  0.837308  0.665054  0.744328  0.540468  0.657550
2021-01-05  0.372198  0.687217  0.044099  0.259574  0.072387
...              ...       ...       ...       ...       ...
2022-08-19  0.188307  0.457193  0.431630  0.288441  0.829495
2022-08-20  0.879451  0.098357  0.629108  0.059265  0.775356
2022-08-21  0.384942  0.598208  0.650608  0.876388  0.110685
2022-08-22  0.771109  0.357694  0.979289  0.607972  0.324029
2022-08-23  0.521814  0.754326  0.863149  0.650374  0.899580

[600 rows x 5 columns]

## 2.7. Limpeza dos dados

### 2.7.1 Sumarização dos dados

In [133]:
datas = pd.date_range('20180101', periods = 6)

df = pd.DataFrame(np.random.randn(6,4), index = datas, columns = ['var_A', 'var_B', 'var_C', 'var_D'])

In [134]:
df2 = pd.DataFrame({'A': pd.Timestamp('20130102'),
                    'B': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'C': np.array([3] * 4, dtype = 'int32'),
                    'D': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python'
    
})

In [135]:
df

               var_A     var_B     var_C     var_D
2018-01-01 -1.412941  2.270572 -1.287234  0.657636
2018-01-02 -2.223918  1.774864  0.201484  0.689649
2018-01-03 -1.300187 -1.736732 -0.054170 -0.847345
2018-01-04  0.177493 -0.122855 -0.492506  0.834782
2018-01-05 -0.088960  0.952087 -0.388572  1.286521
2018-01-06  0.029751  0.317284  1.130740  0.348753

In [136]:
df.shape

(6, 4)

In [137]:
df.dtypes

var_A    float64
var_B    float64
var_C    float64
var_D    float64
dtype: object

In [138]:
df.describe()

          var_A     var_B     var_C     var_D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.803127  0.575870 -0.148376  0.495000
std    0.980094  1.439052  0.805050  0.725200
min   -2.223918 -1.736732 -1.287234 -0.847345
25%   -1.384752 -0.012820 -0.466523  0.425974
50%   -0.694574  0.634686 -0.221371  0.673643
75%    0.000073  1.569170  0.137570  0.798499
max    0.177493  2.270572  1.130740  1.286521

In [139]:
df2

           A    B  C      D       F
0 2013-01-02  1.0  3   test  Python
1 2013-01-02  1.0  3  train  Python
2 2013-01-02  1.0  3   test  Python
3 2013-01-02  1.0  3  train  Python

In [140]:
df.shape

(6, 4)

In [141]:
df2.dtypes

A    datetime64[ns]
B           float32
C             int32
D          category
F            object
dtype: object

In [142]:
df2.describe()

         B    C
count  4.0  4.0
mean   1.0  3.0
std    0.0  0.0
min    1.0  3.0
25%    1.0  3.0
50%    1.0  3.0
75%    1.0  3.0
max    1.0  3.0

In [143]:
df

               var_A     var_B     var_C     var_D
2018-01-01 -1.412941  2.270572 -1.287234  0.657636
2018-01-02 -2.223918  1.774864  0.201484  0.689649
2018-01-03 -1.300187 -1.736732 -0.054170 -0.847345
2018-01-04  0.177493 -0.122855 -0.492506  0.834782
2018-01-05 -0.088960  0.952087 -0.388572  1.286521
2018-01-06  0.029751  0.317284  1.130740  0.348753

In [144]:
df1 = df.reindex(index = datas [ 0: 4 ], columns = list(df.columns) + ['var_E'])

In [145]:
df1

               var_A     var_B     var_C     var_D  var_E
2018-01-01 -1.412941  2.270572 -1.287234  0.657636    NaN
2018-01-02 -2.223918  1.774864  0.201484  0.689649    NaN
2018-01-03 -1.300187 -1.736732 -0.054170 -0.847345    NaN
2018-01-04  0.177493 -0.122855 -0.492506  0.834782    NaN

In [146]:
df1.loc[datas[0]: datas [1], 'var_E'] = 77

In [147]:
df1

               var_A     var_B     var_C     var_D  var_E
2018-01-01 -1.412941  2.270572 -1.287234  0.657636   77.0
2018-01-02 -2.223918  1.774864  0.201484  0.689649   77.0
2018-01-03 -1.300187 -1.736732 -0.054170 -0.847345    NaN
2018-01-04  0.177493 -0.122855 -0.492506  0.834782    NaN

In [148]:
df1.describe()

          var_A     var_B     var_C     var_D  var_E
count  4.000000  4.000000  4.000000  4.000000    2.0
mean  -1.189888  0.546462 -0.408107  0.333681   77.0
std    1.000145  1.838703  0.652395  0.791114    0.0
min   -2.223918 -1.736732 -1.287234 -0.847345   77.0
25%   -1.615685 -0.526324 -0.691188  0.281391   77.0
50%   -1.356564  0.826005 -0.273338  0.673643   77.0
75%   -0.930767  1.898791  0.009743  0.725932   77.0
max    0.177493  2.270572  0.201484  0.834782   77.0

### 2.7.2. Dados faltantes NaN

In [149]:
datas = pd.date_range('20180101', periods = 60, freq="D")

df = pd.DataFrame(np.random.randn(60,5), index = datas, columns = list("ABCDE"))

In [150]:
df.head(3)

                   A         B         C         D         E
2018-01-01  0.647581  0.999454  0.837769 -1.972338  0.892713
2018-01-02  1.251573  0.102169  0.983943  0.315426 -1.945528
2018-01-03 -0.280812  0.926423  0.578059 -0.211619  1.184339

In [151]:
df['F'] = df.A[df.A > 0]

In [152]:
df.head(3)

                   A         B         C         D         E         F
2018-01-01  0.647581  0.999454  0.837769 -1.972338  0.892713  0.647581
2018-01-02  1.251573  0.102169  0.983943  0.315426 -1.945528  1.251573
2018-01-03 -0.280812  0.926423  0.578059 -0.211619  1.184339       NaN

In [153]:
df1 = df.copy()

In [154]:
df2 = df.copy()

**Extração dos valores NaN. Sempre que ultilizamos este comando, também perdemos os demais dados da linha.**

In [155]:
df1.dropna().shape

(30, 6)

In [156]:
df.shape

(60, 6)

In [157]:
df2.head()

                   A         B         C         D         E         F
2018-01-01  0.647581  0.999454  0.837769 -1.972338  0.892713  0.647581
2018-01-02  1.251573  0.102169  0.983943  0.315426 -1.945528  1.251573
2018-01-03 -0.280812  0.926423  0.578059 -0.211619  1.184339       NaN
2018-01-04  1.155684 -0.793745  0.085784 -0.866815 -1.834423  1.155684
2018-01-05 -0.336098 -0.555097 -2.716628  1.572390 -1.757926       NaN

**Substituição dos valores NaN pela média da coluna F**

In [158]:
df2.F.fillna(np.mean(df2.F))

2018-01-01    0.647581
2018-01-02    1.251573
2018-01-03    0.675765
2018-01-04    1.155684
2018-01-05    0.675765
2018-01-06    0.675765
2018-01-07    0.181834
2018-01-08    0.102037
2018-01-09    0.675765
2018-01-10    0.145991
2018-01-11    0.675765
2018-01-12    0.675765
2018-01-13    1.439649
2018-01-14    0.113456
2018-01-15    0.675765
2018-01-16    0.529068
2018-01-17    0.803713
2018-01-18    0.675765
2018-01-19    0.147765
2018-01-20    1.642556
2018-01-21    0.675765
2018-01-22    0.675765
2018-01-23    0.876531
2018-01-24    0.675765
2018-01-25    1.199881
2018-01-26    0.475056
2018-01-27    0.675765
2018-01-28    0.675765
2018-01-29    0.675765
2018-01-30    0.675765
2018-01-31    0.202707
2018-02-01    0.906781
2018-02-02    0.675765
2018-02-03    0.675765
2018-02-04    0.675765
2018-02-05    0.861446
2018-02-06    0.637146
2018-02-07    0.089052
2018-02-08    0.675765
2018-02-09    0.889061
2018-02-10    0.172216
2018-02-11    0.675765
2018-02-12    0.675765
2018-02-13    0.675765
2018-02-14    0.675765
2018-02-15    0.500941
2018-02-16    0.675765
2018-02-17    0.675765
2018-02-18    0.675765
2018-02-19    0.523632
2018-02-20    0.675765
2018-02-21    0.329641
2018-02-22    1.083289
2018-02-23    0.675765
2018-02-24    1.411320
2018-02-25    0.534811
2018-02-26    1.315074
2018-02-27    0.675765
2018-02-28    0.103471
2018-03-01    0.675765
Freq: D, Name: F, dtype: float64

In [159]:
df3 = df.copy()

**Substituição de TODOS os valores NaN da tabela por 777**

In [160]:
df3.fillna(value = 777)

                   A         B         C         D         E           F
2018-01-01  0.647581  0.999454  0.837769 -1.972338  0.892713    0.647581
2018-01-02  1.251573  0.102169  0.983943  0.315426 -1.945528    1.251573
2018-01-03 -0.280812  0.926423  0.578059 -0.211619  1.184339  777.000000
2018-01-04  1.155684 -0.793745  0.085784 -0.866815 -1.834423    1.155684
2018-01-05 -0.336098 -0.555097 -2.716628  1.572390 -1.757926  777.000000
2018-01-06 -0.375485  0.461145  0.098959 -1.770803  0.862419  777.000000
2018-01-07  0.181834 -2.358615 -1.539701 -0.133872  1.564670    0.181834
2018-01-08  0.102037  0.430319  1.327440 -1.525267 -1.059924    0.102037
2018-01-09 -1.376594 -0.424772 -1.353171  0.518392  0.061023  777.000000
2018-01-10  0.145991 -2.278529 -0.292067  1.505037 -0.930969    0.145991
2018-01-11 -0.563449  0.508420  0.623685 -1.896267 -0.692272  777.000000
2018-01-12 -2.228108 -0.529599  2.449412  0.913192 -1.490348  777.000000
2018-01-13  1.439649 -0.891948  1.758443  0.883523  0.159023    1.439649
2018-01-14  0.113456  0.005051  0.020021  0.501258  0.396175    0.113456
2018-01-15 -0.214894  0.844470  1.100283  0.572021 -0.657714  777.000000
2018-01-16  0.529068  0.392652  0.521807 -1.224534 -0.530729    0.529068
2018-01-17  0.803713 -1.252184  0.576870 -0.616939 -0.369596    0.803713
2018-01-18 -0.195782  0.475533  0.727619 -0.644422 -0.798231  777.000000
2018-01-19  0.147765  1.498400 -0.155889 -1.576505  0.458755    0.147765
2018-01-20  1.642556 -1.365783 -0.413234 -0.773814 -1.095756    1.642556
2018-01-21 -0.113893 -0.058473 -0.018423 -1.441690 -0.743936  777.000000
2018-01-22 -2.038456  0.158964 -1.198160  1.643549  0.194696  777.000000
2018-01-23  0.876531 -0.081752  0.675151 -1.053310 -0.953978    0.876531
2018-01-24 -0.468963  1.558764  2.386896 -0.988873  0.335720  777.000000
2018-01-25  1.199881 -0.494817  0.171767  1.513412 -0.240934    1.199881
2018-01-26  0.475056  1.586685 -1.097272  0.390188 -1.496421    0.475056
2018-01-27 -0.350344 -0.642061  0.045200 -0.950750 -0.193890  777.000000
2018-01-28 -0.014424 -0.338079 -0.918327  0.805955 -0.288135  777.000000
2018-01-29 -0.494586  0.934384  1.019390  2.094206  0.647456  777.000000
2018-01-30 -1.869451  1.132541  0.266159  1.153330 -2.721533  777.000000
2018-01-31  0.202707  0.946743 -0.600827 -0.575501  1.356587    0.202707
2018-02-01  0.906781  1.665487  1.326635 -1.531985  1.050624    0.906781
2018-02-02 -0.292199 -0.891041 -0.520421  0.640233 -1.914164  777.000000
2018-02-03 -0.047045 -0.455325  1.447025  0.177986 -0.201079  777.000000
2018-02-04 -2.165237  1.410151  0.481055 -1.395016  0.330061  777.000000
2018-02-05  0.861446  0.287274 -2.255376  1.327605 -1.302619    0.861446
2018-02-06  0.637146  0.436074 -0.046610 -0.472036 -1.660541    0.637146
2018-02-07  0.089052 -0.320411  0.191560  0.511422 -0.910080    0.089052
2018-02-08 -0.581836 -1.181834 -0.424918  0.838553  0.461521  777.000000
2018-02-09  0.889061 -0.379998  0.681560  0.701840 -0.175247    0.889061
2018-02-10  0.172216 -0.645919  0.443551 -1.458968  0.383977    0.172216
2018-02-11 -0.410066  0.602322  0.042015 -0.193112  0.665371  777.000000
2018-02-12 -1.019992 -0.498532 -0.621780  0.295128 -0.358633  777.000000
2018-02-13 -1.369599  1.371800  0.081825 -0.346615 -0.578785  777.000000
2018-02-14 -0.450804  0.518367 -1.474939  0.911730 -0.989961  777.000000
2018-02-15  0.500941 -0.590471  0.050793 -2.089201 -0.526989    0.500941
2018-02-16 -1.359500  0.041385 -0.392864  0.398349  0.992212  777.000000
2018-02-17 -0.238370 -2.251406  2.055518  1.555955  2.999591  777.000000
2018-02-18 -0.453478  1.003979 -0.257540 -1.527108  0.875804  777.000000
2018-02-19  0.523632 -0.369205  0.308626 -0.035765 -1.704355    0.523632
2018-02-20 -0.397369  0.826167  0.426142  0.585159 -0.365893  777.000000
2018-02-21  0.329641  0.609049  0.850284 -1.297019  0.607967    0.329641
2018-02-22  1.083289 -0.653949  0.315254 -0.687218  0.627508    1.083289
2018-02-23 -0.028968 -1.298129 -1.032413 -2.716123 -1.453066  777.000000
2018-02-24  1.411320  1.330239  1.051961  0.166371  0.402809    1.411320
2018-02-25  0.534811  1.168270 -0.270859  1.698650 -0.985874    0.534811
2018-02-26  1.315074  0.458564  1.425910  0.657782 -0.521309    1.315074
2018-02-27 -0.221356  0.557885 -0.225546 -0.814844 -1.349547  777.000000
2018-02-28  0.103471  0.603574  1.229180 -0.590681  0.620927    0.103471
2018-03-01 -0.757382 -0.713507 -0.964913 -1.106067 -0.766835  777.000000

### 2.7.3. Dados únicos

In [161]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index = list(range(4)), dtype= 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'Python',
                    'G': [2, 2, 4, 4],http://localhost:8888/notebooks/Desktop/ad/analise_de_dados/notebooks/fundamentos_da_linguagem_python.ipynb#2.7.3.-Dados-%C3%BAnicos
                    'H': [np.nan, 2, 4, np.nan]
    
})

In [162]:
df2

     A          B    C  D      E       F  G    H
0  1.0 2013-01-02  1.0  3   test  Python  2  NaN
1  1.0 2013-01-02  1.0  3  train  Python  2  2.0
2  1.0 2013-01-02  1.0  3   test  Python  4  4.0
3  1.0 2013-01-02  1.0  3  train  Python  4  NaN

Sempre que usar a função nunique ela aponta os dados ÚNICOS ( axis=0 está relacionado a linha e axis= 1 à coluna)

In [163]:
df2.nunique(axis = 1, dropna = True)

0    6
1    6
2    6
3    6
dtype: int64

### 2.7.4. Dados duplicados

**Essa função mostra valores duplicados em todas as linhas**

In [164]:
df2.drop_duplicates()

     A          B    C  D      E       F  G    H
0  1.0 2013-01-02  1.0  3   test  Python  2  NaN
1  1.0 2013-01-02  1.0  3  train  Python  2  2.0
2  1.0 2013-01-02  1.0  3   test  Python  4  4.0
3  1.0 2013-01-02  1.0  3  train  Python  4  NaN

**Essa função mantém o 1° valor e exclui os valores duplicados na coluna especificada**

In [165]:
df2.drop_duplicates(subset= 'G')

     A          B    C  D     E       F  G    H
0  1.0 2013-01-02  1.0  3  test  Python  2  NaN
2  1.0 2013-01-02  1.0  3  test  Python  4  4.0

### 2.7.5. Ordenação dos dados

In [166]:
df = pd.DataFrame({
                    'col1' : [ 'A', 'A', 'B', np.nan, 'D', 'C' ],  
                    'col2' : [ 2, 1, 9, 8, 7, 4 ],
                    'col3' : [ 0, 1, 9, 4, 2, 3 ],
                })

In [167]:
df

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
3  NaN     8     4
4    D     7     2
5    C     4     3

**Ordenação de valores pela coluna 1**

In [168]:
df.sort_values(by='col1')

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
5    C     4     3
4    D     7     2
3  NaN     8     4

**Ordenação de valores pelas colunas 1 e 2**

In [169]:
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3
1    A     1     1
0    A     2     0
2    B     9     9
5    C     4     3
4    D     7     2
3  NaN     8     4

**Ordenação de valores pelas colunas 1 e 2 de forma decrescente**

In [170]:
df.sort_values(by=['col1', 'col2'], ascending= False)

  col1  col2  col3
4    D     7     2
5    C     4     3
2    B     9     9
0    A     2     0
1    A     1     1
3  NaN     8     4